<?php
/**
 * Created by PhpStorm.
 * User: nik
 * Date: 01.07.2018
 * Time: 16:37
 */
header('Content-type: text/html; charset=utf-8');

/*
 *задание №1
 */
$val = 0;
while ($val < 101) {
    if ($val % 3 === 0 && $val !== 0) {
        echo "statement=$val <br>";
    }
    ++$val;
}
echo "<hr>";
/*
 *задание 2
 */
$val = 0;
do {
    if ($val === 0) {
        echo "$val-это ноль<br>";

    } elseif (!($val & 1)) {
        echo "$val-четное число<br>";

    } else {
        echo "$val-нечетное число<br>";
    }
    ++$val;
} while ($val <= 10);
echo "<hr>";
/*
 * задание №3 и №8
 *
 *
 * */
$cities = [
    "Адыгея" => ["Адыгейск", "Майкоп"],
    "Алтайский край" => ["Яровое", "Славгород", "Горно-Алтайск", "Алейск", "Барнаул", "Белокуриха", "Бийск", "Горняк",
        "Заринск", "Змеиногорск", "Камень-на-Оби", "Новоалтайск", "Рубцовск"],
    "Амурская область" => ["Шимановск", "Циолковский", "Тында", "Сковородино", "Свободный", "Райчихинск", "Зея",
        "Завитинск", "Благовещенск", "Белогорск"],
    "Архангельская область" => ["Шенкурск", "Сольвычегодск", "Северодвинск", "Онега", "Няндома", "Новодвинск",
        "Мирный", "Мезень", "Котлас", "Коряжма", "Каргополь", "Вельск", "Архангельск"],
    "Астраханская область" => ["Харабали", "Нариманов", "Камызяк", "Знаменск", "Ахтубинск", "Астрахань",],
    "Башкортостан" => ["Янаул", "Учалы", "Уфа", "Туймазы", "Стерлитамак", "Сибай", "Салават", "Октябрьский",
        "Нефтекамск", "Мелеуз", "Межгорье", "Кумертау", "Ишимбай", "Дюртюли", "Давлеканово", "Благовещенск",
        "Бирск", "Белорецк", "Белебей", "Баймак", "Агидель",],
    "Белгородская область" => ["Шебекино", "Строитель", "Старый Оскол", "Новый Оскол", "Короча", "Губкин", "Грайворон",
        "Валуйки", "Бирюч", "Белгород", "Алексеевка"],
    "Брянская область" => ["Фокино", "Унеча", "Трубчевск", "Сураж", "Стародуб", "Сельцо", "Севск", "Почеп",
        "Новозыбков", "Мглин", "Клинцы", "Карачев", "Злынка", "Жуковка", "Дятьково", "Брянск",],
    "Бурятия" => ["Улан-Удэ", "Северобайкальск", "Кяхта", "Закаменск", "Гусиноозёрск", "Бабушкин",],
    "Владимирская область" => ["Юрьев-Польский", "Суздаль", "Судогда", "Струнино", "Собинка", "Радужный", "Покров",
        "Петушки", "Муром", "Меленки", "Лакинск", "Курлово", "Костерёво", "Кольчугино", "Ковров", "Киржач",
        "Карабаново", "Камешково", "Гусь-Хрустальный", "Гороховец", "Вязники", "Владимир", "Александров",],
];
function cityOnScreen($array, $liter)
{
    foreach ($array as $key => $value) {
        echo "$key:<br>";
        for ($i = 0; $i <= count($value); $i++) {
            if (mb_substr($value[$i], 0, 1) === $liter) {
                echo "$value[$i], ";
            }
        }
        echo "<br>";
        unset($value);
        unset($key);
    }
}

cityOnScreen($cities, "К");
echo "<br><hr>";
//----------------------------------------------------------------------------------------

$transliteration = [
    "а" => "a",
    "б" => "b",
    "в" => "v",
    "г" => "g",
    "д" => "d",
    "е" => "e",
    "ё" => "e",
    "ж" => "zh",
    "з" => "z",
    "и" => "i",
    "й" => "y",
    "к" => "k",
    "л" => "l",
    "м" => "m",
    "н" => "n",
    "о" => "o",
    "п" => "p",
    "р" => "r",
    "с" => "s",
    "т" => "t",
    "у" => "u",
    "ф" => "f",
    "х" => "kh",
    "ц" => "ts",
    "ч" => "ch",
    "ш" => "sh",
    "щ" => "sch",
    "ъ" => "",
    "ы" => "i",
    "ь" => "",
    "э" => "e",
    "ю" => "yu",
    "я" => "ya",
];
/*
 * Задание №4  и видимо задание №9
 *
 * */
function trans(string $str)
{
    global $transliteration;
    $str = mb_strtolower($str);
    $strArray = [];
    $strLen=mb_strlen($str);
    for ($i = 0; $i <= $strLen; $i++) {
        array_push($strArray, mb_substr($str, $i, 1));
    }
    $newStrArray = [];
    foreach ($strArray as $item => $val) {
        if (mb_ereg_match("\W", mb_substr($val, 0))) {
            array_push($newStrArray, $val);
        }
        foreach ($transliteration as $key => $value) {
            if (mb_substr($val, 0) === mb_substr($key, 0)) {
                array_push($newStrArray, $value);

            }
        }
    }
    unset($val);
    unset($item);
    unset($value);
    unset($key);
    $newStr = implode($newStrArray);
    echo "новая строка = $newStr<br>";
    return $newStr;
}
/*
 * Задание №5
 *
 * */
function spaceReplace($string)
{
    $result=strtr($string," ", "_");
    return $result;
}



echo spaceReplace(trans('не знАю даже, что лучШе (я в это время был дома)-быть или! не быть?'));

echo "<br><hr>";
/*
 * задание №7
 * */
for ($y = 0; $y < 10; print_r($y++)) {
}
echo "<br><hr>";

